app/Cells/ArtikelTerkini.php

    public function tampil()
    {
        $model = new ArtikelModel();
        // Mengambil 5 artikel paling baru berdasarkan tanggal (created_at)
        $artikel = $model->orderBy('created_at', 'DESC')->limit(5)->findAll();
---
SELECT *
FROM `artikel`
ORDER BY `created_at` DESC
 LIMIT 5